codeigniter4/app/Controllers/Admin.php

    public function index()
    {
        log_message('debug', '=== DÉBUT MÉTHODE INDEX ===');

        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM "users"

                } else {
                    log_message('error', 'Échec de la mise à jour: ' . json_encode($model->errors()));
                    $data['errors'] = $model->errors();
                    $data['user'] = $model->find($id);
---
SELECT *
FROM "users"
WHERE "users"."id" = '5'

        }

        log_message('debug', 'Affichage du formulaire de modification');
        $data['user'] = $model->find($id);
---
SELECT *
FROM "users"
WHERE "users"."id" = '20'